brew "chezmoi"
brew "cloc"
brew "curl"
brew "expect"
brew "hadoop"
brew "lua"
brew "openjdk"
brew "maven"
brew "openjdk@17"
brew "python@3.13"
brew "ranger"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "wget"
brew "z"
brew "zsh"
cask "claude-code"
vscode "antfu.icons-carbon"
vscode "antfu.theme-vitesse"
vscode "bierner.markdown-mermaid"
vscode "golang.go"
vscode "qiu8310.minapp-vscode"
vscode "redhat.java"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
go "git.xiaojukeji.com/nuwa/nuwa"
go "honnef.co/go/tools/cmd/staticcheck"
